zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F83xxx/periph/PERI_PWM.h
/*
** ###################################################################
**     Processors:          MC56F83663VLH
**                          MC56F83683VLH
**                          MC56F83686VLK
**                          MC56F83689VLL
**                          MC56F83763AVLH
**                          MC56F83763VLH
**                          MC56F83766VLK
**                          MC56F83769AVLL
**                          MC56F83769VLL
**                          MC56F83783AVLH
**                          MC56F83783VLH
**                          MC56F83786VLK
**                          MC56F83789AVLL
**                          MC56F83789VLL
**
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for PWM
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2019-09-23)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_PWM.h
 * @version 1.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for PWM
 *
 * CMSIS Peripheral Access Layer for PWM
 */

#if !defined(PERI_PWM_H_)
#define PERI_PWM_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F83663VLH))
#include "MC56F83663_COMMON.h"
#elif (defined(CPU_MC56F83683VLH))
#include "MC56F83683_COMMON.h"
#elif (defined(CPU_MC56F83686VLK))
#include "MC56F83686_COMMON.h"
#elif (defined(CPU_MC56F83689VLL))
#include "MC56F83689_COMMON.h"
#elif (defined(CPU_MC56F83763AVLH) || defined(CPU_MC56F83763VLH))
#include "MC56F83763_COMMON.h"
#elif (defined(CPU_MC56F83766VLK))
#include "MC56F83766_COMMON.h"
#elif (defined(CPU_MC56F83769AVLL) || defined(CPU_MC56F83769VLL))
#include "MC56F83769_COMMON.h"
#elif (defined(CPU_MC56F83783AVLH) || defined(CPU_MC56F83783VLH))
#include "MC56F83783_COMMON.h"
#elif (defined(CPU_MC56F83786VLK))
#include "MC56F83786_COMMON.h"
#elif (defined(CPU_MC56F83789AVLL) || defined(CPU_MC56F83789VLL))
#include "MC56F83789_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma push
  #pragma cpp_extensions on
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- PWM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PWM_Peripheral_Access_Layer PWM Peripheral Access Layer
 * @{
 */

/** PWM - Size of Registers Arrays */
#define PWM_SM_DISMAP_COUNT                       2u
#define PWM_SM_COUNT                              4u
#define PWM_FAULT_COUNT                           2u

/** PWM - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0, array step: 0x30 */
    __I  uint16_t CNT;                               /**< Counter Register, array offset: 0x0, array step: 0x30 */
    __IO uint16_t INIT;                              /**< Initial Count Register, array offset: 0x1, array step: 0x30 */
    __IO uint16_t CTRL2;                             /**< Control 2 Register, array offset: 0x2, array step: 0x30 */
    __IO uint16_t CTRL;                              /**< Control Register, array offset: 0x3, array step: 0x30 */
         uint16_t RESERVED_0[1];
    __IO uint16_t VAL0;                              /**< Value Register 0, array offset: 0x5, array step: 0x30 */
    __IO uint16_t FRACVAL1;                          /**< Fractional Value Register 1, array offset: 0x6, array step: 0x30 */
    __IO uint16_t VAL1;                              /**< Value Register 1, array offset: 0x7, array step: 0x30 */
    __IO uint16_t FRACVAL2;                          /**< Fractional Value Register 2, array offset: 0x8, array step: 0x30 */
    __IO uint16_t VAL2;                              /**< Value Register 2, array offset: 0x9, array step: 0x30 */
    __IO uint16_t FRACVAL3;                          /**< Fractional Value Register 3, array offset: 0xA, array step: 0x30 */
    __IO uint16_t VAL3;                              /**< Value Register 3, array offset: 0xB, array step: 0x30 */
    __IO uint16_t FRACVAL4;                          /**< Fractional Value Register 4, array offset: 0xC, array step: 0x30 */
    __IO uint16_t VAL4;                              /**< Value Register 4, array offset: 0xD, array step: 0x30 */
    __IO uint16_t FRACVAL5;                          /**< Fractional Value Register 5, array offset: 0xE, array step: 0x30 */
    __IO uint16_t VAL5;                              /**< Value Register 5, array offset: 0xF, array step: 0x30 */
    __IO uint16_t FRCTRL;                            /**< Fractional Control Register, array offset: 0x10, array step: 0x30 */
    __IO uint16_t OCTRL;                             /**< Output Control Register, array offset: 0x11, array step: 0x30 */
    __IO uint16_t STS;                               /**< Status Register, array offset: 0x12, array step: 0x30 */
    __IO uint16_t INTEN;                             /**< Interrupt Enable Register, array offset: 0x13, array step: 0x30 */
    __IO uint16_t DMAEN;                             /**< DMA Enable Register, array offset: 0x14, array step: 0x30 */
    __IO uint16_t TCTRL;                             /**< Output Trigger Control Register, array offset: 0x15, array step: 0x30 */
    __IO uint16_t DISMAP[PWM_SM_DISMAP_COUNT];       /**< Fault Disable Mapping Register 0..Fault Disable Mapping Register 1, array offset: 0x16, array step: index*0x30, index2*0x1 */
    __IO uint16_t DTCNT0;                            /**< Deadtime Count Register 0, array offset: 0x18, array step: 0x30 */
    __IO uint16_t DTCNT1;                            /**< Deadtime Count Register 1, array offset: 0x19, array step: 0x30 */
    __IO uint16_t CAPTCTRLA;                         /**< Capture Control A Register, array offset: 0x1A, array step: 0x30 */
    __IO uint16_t CAPTCOMPA;                         /**< Capture Compare A Register, array offset: 0x1B, array step: 0x30 */
    __IO uint16_t CAPTCTRLB;                         /**< Capture Control B Register, array offset: 0x1C, array step: 0x30 */
    __IO uint16_t CAPTCOMPB;                         /**< Capture Compare B Register, array offset: 0x1D, array step: 0x30 */
    __IO uint16_t CAPTCTRLX;                         /**< Capture Control X Register, array offset: 0x1E, array step: 0x30 */
    __IO uint16_t CAPTCOMPX;                         /**< Capture Compare X Register, array offset: 0x1F, array step: 0x30 */
    __I  uint16_t CVAL0;                             /**< Capture Value 0 Register, array offset: 0x20, array step: 0x30 */
    __I  uint16_t CVAL0CYC;                          /**< Capture Value 0 Cycle Register, array offset: 0x21, array step: 0x30 */
    __I  uint16_t CVAL1;                             /**< Capture Value 1 Register, array offset: 0x22, array step: 0x30 */
    __I  uint16_t CVAL1CYC;                          /**< Capture Value 1 Cycle Register, array offset: 0x23, array step: 0x30 */
    __I  uint16_t CVAL2;                             /**< Capture Value 2 Register, array offset: 0x24, array step: 0x30 */
    __I  uint16_t CVAL2CYC;                          /**< Capture Value 2 Cycle Register, array offset: 0x25, array step: 0x30 */
    __I  uint16_t CVAL3;                             /**< Capture Value 3 Register, array offset: 0x26, array step: 0x30 */
    __I  uint16_t CVAL3CYC;                          /**< Capture Value 3 Cycle Register, array offset: 0x27, array step: 0x30 */
    __I  uint16_t CVAL4;                             /**< Capture Value 4 Register, array offset: 0x28, array step: 0x30 */
    __I  uint16_t CVAL4CYC;                          /**< Capture Value 4 Cycle Register, array offset: 0x29, array step: 0x30 */
    __I  uint16_t CVAL5;                             /**< Capture Value 5 Register, array offset: 0x2A, array step: 0x30 */
    __I  uint16_t CVAL5CYC;                          /**< Capture Value 5 Cycle Register, array offset: 0x2B, array step: 0x30 */
    __IO uint16_t PHASEDLY;                          /**< Phase Delay Register, array offset: 0x2C, array step: 0x30, valid indices: [1-3] */
         uint16_t RESERVED_1[3];
  } SM[PWM_SM_COUNT];
  __IO uint16_t OUTEN;                             /**< Output Enable Register, offset: 0xC0 */
  __IO uint16_t MASK;                              /**< Mask Register, offset: 0xC1 */
  __IO uint16_t SWCOUT;                            /**< Software Controlled Output Register, offset: 0xC2 */
  __IO uint16_t DTSRCSEL;                          /**< PWM Source Select Register, offset: 0xC3 */
  __IO uint16_t MCTRL;                             /**< Master Control Register, offset: 0xC4 */
  __IO uint16_t MCTRL2;                            /**< Master Control 2 Register, offset: 0xC5, not available in all instances (available on 20 out of 28) */
  struct {                                         /* offset: 0xC6, array step: 0x6 */
    __IO uint16_t FCTRL;                             /**< Fault Control Register, array offset: 0xC6, array step: 0x6 */
    __IO uint16_t FSTS;                              /**< Fault Status Register, array offset: 0xC7, array step: 0x6 */
    __IO uint16_t FFILT;                             /**< Fault Filter Register, array offset: 0xC8, array step: 0x6 */
    __IO uint16_t FTST;                              /**< Fault Test Register, array offset: 0xC9, array step: 0x6 */
    __IO uint16_t FCTRL2;                            /**< Fault Control 2 Register, array offset: 0xCA, array step: 0x6 */
         uint16_t RESERVED_0[1];
  } FAULT[PWM_FAULT_COUNT];
} PWM_Type;

/* ----------------------------------------------------------------------------
   -- PWM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PWM_Register_Masks PWM Register Masks
 * @{
 */

